---
kind: method
id: M:Autodesk.Revit.DB.ParameterDownloadOptions.GetCategories
source: html/df218962-7c74-4c70-ba45-712920b26e11.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.GetCategories Method

Get categories for binding.

## Syntax (C#)
```csharp
public ISet<ElementId> GetCategories()
```